InformationRegisters/упСтатусыВходящихПретензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыВходящихПретензий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыВходящейПретензии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упВходящаяПретензия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПретензииПоЗаявкамНаПеревозкуГруза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПретензииПоЗаявкамНаПеревозкуГруза</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПретензии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПричиныПретензий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Претензия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упИсходящаяПретензия</v8:Type>
						<v8:Type>cfg:DocumentRef.упВходящаяПретензия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упПретензииПоРейсам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упПретензииПоРейсам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПретензии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПричиныПретензий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Претензия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упИсходящаяПретензия</v8:Type>
						<v8:Type>cfg:DocumentRef.упВходящаяПретензия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/упВходящаяПретензия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура формирует движения по регистру "упСтатусыВходящихПретензий".
//
// Параметры:
//  ДополнительныеСвойства	 - Структура	 - Свойства.
//  Ссылка				 - ДокументСсылка	 - Ссылка на элемент.
//  Движения				 - КоллекцияДвижений - Коллекция движений документа.
//  Реквизиты				 - Структура		 - Реквизиты объекта.
//  Отказ					 - Булево			 - флаг ошибки.
//
Процедура СформироватьДвиженияСтатусВходящейПретензии(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияСтатуса = Движения.упСтатусыВходящихПретензий;
	
	Статус				    = ДополнительныеСвойства.Статус;
	ЗаписыватьСтатус	= ДополнительныеСвойства.ЗаписыватьСтатус;
	Если ЗаписыватьСтатус Тогда
		ДвиженияСтатуса.Записывать = Истина;
		ДвиженияСтатуса.Прочитать();
		
		ДвижениеСтатуса = ДвиженияСтатуса.Добавить();
		ДвижениеСтатуса.Период      = ТекущаяДатаСеанса();
		ДвижениеСтатуса.Документ    = Ссылка;
		ДвижениеСтатуса.Статус      = Статус;
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует движения по регистру "упПретензииПоЗаявкамНаПеревозкуГруза".
//
// Параметры:
//  ДополнительныеСвойства	 - Структура	 - Свойства.
//  Ссылка				 - ДокументСсылка	 - Ссылка на элемент.
//  Движения				 - КоллекцияДвижений - Коллекция движений документа.
//  Реквизиты				 - Структура		 - Реквизиты объекта.
//  Отказ					 - Булево			 - флаг ошибки.
//
Процедура СформироватьДвиженияПоЗаявкеВходящейПретензии(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияПоЗаявкам = Движения.упПретензииПоЗаявкамНаПеревозкуГруза;
	ДвиженияПоЗаявкам.Записывать = Истина;
	
	Заявка	= Реквизиты.ЗаявкаНаПеревозкуГруза;
	Если ЗначениеЗаполнено(Заявка)  Тогда
		
		Движение = ДвиженияПоЗаявкам.Добавить();
		Движение.Период                             = ТекущаяДатаСеанса();
		Движение.ЗаявкаНаПеревозкуГруза   = Заявка;
		Движение.Рейс                                 = Реквизиты.Рейс;
		Движение.Претензия                         = Ссылка;
		Движение.ПричинаПретензии             = Реквизиты.ПричинаПретензии; 
		Движение.Партнер                            = Реквизиты.Партнер;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует движения по регистру "упПретензииПоРейсам".
//
// Параметры:
//  ДополнительныеСвойства	 - Структура	 - Свойства.
//  Ссылка				 - ДокументСсылка	 - Ссылка на элемент.
//  Движения				 - КоллекцияДвижений - Коллекция движений документа.
//  Реквизиты				 - Структура		 - Реквизиты объекта.
//  Отказ					 - Булево			 - флаг ошибки.
//
Процедура СформироватьДвиженияПоРейсуВходящейПретензии(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияПоРейсам = Движения.упПретензииПоРейсам;
	ДвиженияПоРейсам.Записывать = Истина;
	
	Рейс	= Реквизиты.Рейс;
	Если ЗначениеЗаполнено(Рейс)  Тогда
		
		Движение = ДвиженияПоРейсам.Добавить();
		Движение.Период                             = ТекущаяДатаСеанса();
		Движение.Рейс                                 = Рейс;
		Движение.Претензия                         = Ссылка;
		Движение.ПричинаПретензии             = Реквизиты.ПричинаПретензии; 
		Движение.Партнер                            = Реквизиты.Партнер;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует движения по регистру "упРасходы".
//
// Параметры:
//  ДополнительныеСвойства	 - Структура	 - Свойства.
//  Ссылка				 - ДокументСсылка	 - Ссылка на элемент.
//  Движения				 - КоллекцияДвижений - Коллекция движений документа.
//  Реквизиты				 - Структура		 - Реквизиты объекта.
//  Отказ					 - Булево			 - флаг ошибки.
//
Процедура СформироватьДвиженияРасходы(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	упРаспределениеРасходов.СформироватьРасходы(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ);
КонецПроцедуры	
	
#КонецОбласти
